purnankareddy/CC3200MOD-SDK/samples/tirtos/subscribe_publish_sample/subscribe_publish_sample.c
/*
 * Copyright 2010-2016 Amazon.com, Inc. or its affiliates. All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License").
 * You may not use this file except in compliance with the License.
 * A copy of the License is located at
 *
 *  http://aws.amazon.com/apache2.0
 *
 * or in the "license" file accompanying this file. This file is distributed
 * on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either
 * express or implied. See the License for the specific language governing
 * permissions and limitations under the License.
 */
#include <string.h>
//#include <list.h>
/*
#include <stdio.h>
#include <stdlib.h>
#include <errno.h>
#ifndef MSOCK_H
#define MSOCK_H

// this is for windows compat
#define SOCKET int

#ifdef __MINGW32__ 
#undef SOCKET
#undef socklen_t 
#define WINVER 0x0501 
#include <ws2tcpip.h> 
#define EWOULDBLOCK WSAEWOULDBLOCK
#define close closesocket
#define socklen_t int
typedef unsigned int in_addr_t;
#else
//#include <sys/socket.h>
//#include <netinet/in.h>
//#include <sys/un.h>
//#include <netinet/tcp.h>
//#include <arpa/inet.h>
#include <netdb.h>
#endif
#ifndef IPV6_ADD_MEMBERSHIP
#define IPV6_ADD_MEMBERSHIP IPV6_JOIN_GROUP
#endif
*/

#include <ti/sysbios/knl/Task.h>
#include "aws_iot_log.h"
#include "aws_iot_version.h"
#include "aws_iot_mqtt_client_interface.h"
#include "aws_iot_config.h"


#include "pin_mux_config.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_gpio.h"
#include "pin.h"
#include "gpio.h"
#include "prcm.h"
#include "rom.h"
#include "rom_map.h"


#include "wificonfig.h"

//------from adc example--------///
// Standard includes
//#include <string.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>

// Driverlib includes
#include "utils.h"
//#include "hw_memmap.h"
#include "hw_common_reg.h"
//#include "hw_types.h"
#include "hw_adc.h"
#include "hw_ints.h"
#include "hw_gprcm.h"
//#include "rom.h"
//#include "rom_map.h"
#include "interrupt.h"
#include "prcm.h"
#include "uart.h"
//#include "pinmux.h"
#include "pin.h"
#include "adc.h"

//#include "adc_userinput.h"
//#include "common/uart_if.h"
//#include "common/common.h"
/////-------------/////
#include "common/udma_if.h"
//#include "common/common.h"
#ifndef NOTERM
#include "common/uart_if.h"
#include "common/uart_if.c"
#endif

// custom headers and defines for udp socket..

//  From SNTP

#include <time.h>

#include <xdc/std.h>
#include <xdc/runtime/System.h>

#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/hal/Seconds.h>
#include <ti/net/sntp/sntp.h>

#include <simplelink.h>
#include <socket.h>

////--------added for http-------///////

#include "jsmn.h"
char philips_id[32] = "3351225515126c7313ee321303497f3";
char philipsgetdata[1500];
int id_len;
int philips_config=0;
char philips_uri[15];
char belkin_uri[10][15];
char HOST_NAME[15];
char philips_request_uri[100];
int HOST_PORT=0;

int enddevicestatus=0;
int philipsidstatus=0;
int philipsipstatus=0;
int belkinipstatus=0;
int philipsget=0;

//////--------hardcoded philips user id----------///////////
//strcpy(philips_id,"3351225515126c7313ee321303497f3");
////////////////


// HTTP Client lib
//#include </home/mdubuntu/ti/tirex-content/CC3200SDK_1.1.0/cc3200-sdk/netapps/http/client/httpcli.h>
//#include </home/mdubuntu/ti/tirex-content/CC3200SDK_1.1.0/cc3200-sdk/netapps/http/client/common.h>

#include <ti/net/http/httpcli.h>
#include <ti/net/http/httpcli.c>
#include <ti/net/http/httpstd.c>
//#include</home/mdubuntu/ti/tirex-content/CC3200SDK_1.1.0/cc3200-sdk/netapps/http/client/httpcli.h>
// For SimpleLink, *********  include sssl.h add ~/ti/<tirtos_cc32xx_x_xx_xx_xx>/products/ns_1_11_00_10/packages/ti/net/http/
#include <ti/net/http/sssl.h>
//#define PUT_REQUEST_URI 	"/api/3351225515126c7313ee321303497f3/lights/1/state"
#define PUT_DATA            "{\"on\":false}"
#define PUT_DATA1            "{\"on\":true}"
#define PUT_DATA2            "{\"on\":false}"

#define POST_REQUEST_URI 	"/upnp/control/basicevent1"
//#define POST_DATA           "{\n\"name\":\"xyz\",\n\"address\":\n{\n\"plot#\":12,\n\"street\":\"abc\",\n\"city\":\"ijk\"\n},\n\"age\":30\n}"
#define POST_DATA "<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body><u:SetBinaryState xmlns:u=\"urn:Belkin:service:basicevent:1\"><BinaryState>0</BinaryState></u:SetBinaryState></s:Body></s:Envelope>"

#define POST_DATA1 "<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body><u:SetBinaryState xmlns:u=\"urn:Belkin:service:basicevent:1\"><BinaryState>1</BinaryState></u:SetBinaryState></s:Body></s:Envelope>"


//#define GET_REQUEST_URI 	"/api/3351225515126c7313ee321303497f3/lights"

#define CONFIG_URI              "/api"
#define CONFIG_DATA		"{\"devicetype\":\"my_hue_app#iphone peter\"}"

//#define sdata  "{\"on\":true}"
//#define HOST_NAME       	"192.168.0.115" //"<host name>"for philips
//#define HOST_PORT 80 //for philips

//#define HOST_NAME       	"192.168.0.108" //"<host name>"fpr belkin
//#define HOST_PORT           49153  //for belkin

#define READ_SIZE           1450
#define MAX_BUFF_SIZE       1460

// from udp//
#define IP_ADDR            0xEFFFFFFA   /* 239.255.255.250 unsigned int ip= 4026531834; */
#define PORT_NUM           1900
#define BUF_SIZE           1400
#define UDP_PACKET_COUNT   10    // default 1000

#define REV_IP(X) ((X << 24) | (( X & 0xff00 ) << 8) | (( X >> 8) & 0xff00 ) | ( X >> 24 ))

#define HELLO_PORT 1900
#define HELLO_GROUP "239.255.255.250"
#define MSGBUFSIZE 576



/////------from udp-----///////// 
//int BsdUdpClient(unsigned short usPort);
//int BsdUdpServer(unsigned short usPort);
static void InitializeAppVariables();
//////-------------///////////

// Application specific status/error codes
typedef enum{
 /* Choosing this number to avoid overlap with host-driver's error codes */
    SOCKET_CREATE_ERROR = -0x7D0,
    BIND_ERROR = SOCKET_CREATE_ERROR - 1,
    SEND_ERROR = BIND_ERROR - 1,
    RECV_ERROR = SEND_ERROR -1,
    SOCKET_CLOSE = RECV_ERROR -1,
/*  Normal */

    DEVICE_NOT_IN_STATION_MODE = -0x7D0,       
    DEVICE_START_FAILED = DEVICE_NOT_IN_STATION_MODE - 1,
    INVALID_HEX_STRING = DEVICE_START_FAILED - 1,
    TCP_RECV_ERROR = INVALID_HEX_STRING - 1,
    TCP_SEND_ERROR = TCP_RECV_ERROR - 1,
    FILE_NOT_FOUND_ERROR = TCP_SEND_ERROR - 1,
    INVALID_SERVER_RESPONSE = FILE_NOT_FOUND_ERROR - 1,
    FORMAT_NOT_SUPPORTED = INVALID_SERVER_RESPONSE - 1,
    FILE_OPEN_FAILED = FORMAT_NOT_SUPPORTED - 1,
    FILE_WRITE_ERROR = FILE_OPEN_FAILED - 1,
    INVALID_FILE = FILE_WRITE_ERROR - 1,
    SERVER_CONNECTION_FAILED = INVALID_FILE - 1,
    GET_HOST_IP_FAILED = SERVER_CONNECTION_FAILED  - 1,
    
    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile unsigned long  g_ulStatus = 0;//SimpleLink Status
unsigned long  g_ulDestinationIP;
unsigned long  g_ulDestinationIp; // IP address of destination server
unsigned long  g_ulGatewayIP = 0; //Network Gateway IP address
//unsigned char  g_ucConnectionSSID[SSID_LEN_MAX+1]; //Connection SSID
//unsigned char  g_ucConnectionBSSID[BSSID_LEN_MAX]; //Connection BSSID
unsigned char g_buff[MAX_BUFF_SIZE+1];
long bytesReceived = 0; // variable to store the file size
//From UDP//
unsigned int   g_uiPortNum = PORT_NUM;
volatile unsigned long  g_ulPacketCount = UDP_PACKET_COUNT;
unsigned char  g_ucSimplelinkstarted = 0;
unsigned long  g_ulIpAddr = 0;
char g_cBsdBuf[BUF_SIZE];

#if defined(ccs) || defined(gcc)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif  
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************


int UDPRECIEVER();
///////////-----from wifi audio app------------////////////

#define INVALID_CLIENT_ADDRESS            0x00000000 //Invalid clientIP 
//*****************************************************************************
//
// MultiCast Group IP Address (Any IP in Range 224.0.0.0 - 239.255.255.255)
//
//*****************************************************************************
#define ADDR_MULTICAST_GROUP 	   0xE00000FB   //"224.0.0.251" //Using mDNS IP
  
//*****************************************************************************
//
// UDP Socket Port
//
//*****************************************************************************
#define AUDIO_PORT                     (1900)  
//*****************************************************************************
//
// Define Packet Size, Rx and Tx Buffer
//
//*****************************************************************************  
#define PACKET_SIZE             1024
#define PLAY_WATERMARK			30*1024
#define RECORD_BUFFER_SIZE     	10*PACKET_SIZE
#define PLAY_BUFFER_SIZE        70*PACKET_SIZE
//*****************************************************************************
//
// UDP Socket Structure
//
//***************************************************************************** 
typedef struct UDPSocket
{
    int iSockDesc; //Socket FD
    struct sockaddr_in Server; //Address to Bind - INADDR_ANY for Local IP
    struct sockaddr_in Client; //Client Address or Multicast Group
    int iServerLength;
    int iClientLength;
}tUDPSocket;
/*int sn =0;
struct belkinips{
	int id;
	char bname[5];
	char ip[15];
};
