purnankareddy/CC3200MOD-SDK/samples/tirtos/subscribe_publish_sample/subscribe_publish_sample.c
struct node{
	struct belkinips bel;
	struct node *link;
};
struct node *head=NULL,*tail=NULL;

struct philips{
	int id;
	char pname[7];
	char ip[15];
}*philipsip;
*/
struct philips_status{
	char bid[2];
	char statuses[400];
//	char type[20];
//	char name[20];
//	char state[5];
//	char bright[4];
//	char reachable[5];
}p_bulbs;

struct philips_status *p_bulb; 

struct node
{
	char bulbid[2];
	char status[400];
	struct node *next;
};
struct node *head = NULL;
struct node *current = NULL;
 

////////////---------------////////         

char timeslap[100];
char userid[10];

///////-------------///////
void sstartNTP(void)
{
    //int ret;
    //unsigned long ip;
    time_t ts;
    ts = time(NULL);
    System_printf("Current time: %s\n", ctime(&ts));
    strncpy(timeslap,ctime(&ts),strlen(ctime(&ts)));
}
//---------------------------------///
static void InitializeAppVariables()
{
    g_ulStatus = 0;
    g_ulGatewayIP = 0;
  //  memset(g_ucConnectionSSID,0,sizeof(g_ucConnectionSSID));
  //  memset(g_ucConnectionBSSID,0,sizeof(g_ucConnectionBSSID));
    g_ulDestinationIp = IP_ADDR;
    g_uiPortNum = PORT_NUM;
    g_ulPacketCount = UDP_PACKET_COUNT;
}

/////vinay udp/////////
int r=0;
char enddevicemname[8];
char enddeviceip[15];
void vinayudp(void)
{
      sockaddr_in addr;
     int fd, nbytes,addrlen;
     //ip_mreq mreq;
     SlSockIpMreq mreq;
	//struct_sl_sock_ip_mreq mreq;
     char msgbuf[MSGBUFSIZE];

     unsigned int yes=1;            /*** MODIFICATION TO ORIGINAL */

     /* create what looks like an ordinary UDP socket */
     if ((fd=socket(AF_INET,SOCK_DGRAM,0)) < 0) {
	  //perror("socket");
	  //exit(1);
	 IOT_INFO("....socket creation failed....\n");
     }


/**** MODIFICATION TO ORIGINAL */
    /* allow multiple sockets to use the same PORT number */
   /* if (setsockopt(fd,SOL_SOCKET,SO_REUSEADDR,&yes,sizeof(yes)) < 0) {
       //perror("Reusing ADDR failed");
       //exit(1);
	IOT_INFO(".....setsockopt failed.....\n");
       }*/
/*** END OF MODIFICATION TO ORIGINAL */

     /* set up destination address */
     memset(&addr,0,sizeof(addr));
     addr.sin_family=AF_INET;
     addr.sin_addr.s_addr=htonl(INADDR_ANY); /* N.B.: differs from sender */
     addr.sin_port=htons(HELLO_PORT);
     
     /* bind to receive address */
     if (bind(fd,(struct sockaddr *) &addr,sizeof(addr)) < 0) {
	 // perror("bind");
	 // exit(1);
	IOT_INFO("....bind failed....\n");
     }
     
     /* use setsockopt() to request that the kernel join a multicast group */
     //mreq.imr_multiaddr.s_addr=inet_addr(HELLO_GROUP);
	//mreq.imr_multiaddr.s_addr=htonl(HELLO_GROUP);
       mreq.imr_multiaddr.s_addr=sl_Htonl((unsigned int)IP_ADDR);
     mreq.imr_interface.s_addr=htonl(INADDR_ANY);
     if (setsockopt(fd,IPPROTO_IP,IP_ADD_MEMBERSHIP,&mreq,sizeof(mreq)) < 0) {
	  //perror("setsockopt");
	  //exit(1);
	  IOT_INFO("......setsockopt failed.....\n");
     }
	int udppackets=0,a=0,b=0;
     /* now just enter a read-print loop */
     while (1) {
	  addrlen=sizeof(addr);
	  if ((nbytes=recvfrom(fd,msgbuf,MSGBUFSIZE,0,
			       (struct sockaddr *) &addr,&addrlen)) < 0) {
	       //perror("recvfrom");
	       //exit(1);
		IOT_INFO(".....recvfrom failed.....\n");
	  }
	 // puts(message);
		//IOT_INFO("....%s.....",msgbuf);
		IOT_INFO("....%d.....",(unsigned int)addr.sin_addr.s_addr);
		IOT_INFO("....%x.....",addr.sin_addr.s_addr);
		IOT_INFO("....%x.....",REV_IP(addr.sin_addr.s_addr));
		unsigned int val = REV_IP(addr.sin_addr.s_addr);

			

		IOT_INFO("%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
		udppackets++;
		IOT_INFO("---udppackets received  %d-----\n",udppackets);
		if(a==0 || b<=10)
		{
			if(a==0)
			{
				if( strstr(msgbuf,"IpBridge"))
				{
					IOT_INFO("philips bridge ip is ---%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
			
					sprintf(philips_uri,"%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
					IOT_INFO("-------%s------\n",philips_uri);
					//*philipsip->id=a++;
					//strcpy(*philipsip->ip,philips_uri);
					//strcpy(*philipsip->pname,"Philips");
					a=1;
					philipsipstatus=1;
					enddevicestatus=1;
				}
			}
			if(b<10)
			{
				if(strstr(msgbuf,"NOTIFY") && strstr(msgbuf,"Belkin"))
				{
					int find=0;
					IOT_INFO("belkin ip is ---%d.%d.%d.%d\n",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
					char uri[15],Bel[5]="Bel";
					int i=0;
					sprintf(uri,"%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
					IOT_INFO("uri is : %s",uri);
					/*
					if(head == NULL){
					struct node *n1=(struct node *)malloc(sizeof(struct node));
					n1->bel.id=sn++;
					strcpy(n1->bel.ip,uri);
					strcat(Bel,sn);
					strcpy(n1->bel.bname,Bel);
					n1->link=NULL;
					head=n1;
					tail=n1;
					}else if(head != NULL){
						struct node *temp=head;
						while(temp->link != NULL){
							if(strcmp(temp->bel.ip,uri))
								temp = temp->link;}
						struct node *new=(struct node *)malloc(sizeof(struct node));
						new->Bel.id=sn++;
						strcpy(new->bel.ip,uri);
						strcat(Bel,sn);
						strcpy(new->bel.bname,Bel);
						new->link=NULL;
						tail = new;
					}*/
					for(i=0;i<10;i++)
					{
						if(!strcmp(belkin_uri[i],uri))
						{
							IOT_INFO("belkin_uri[%d]: {%s} is same as uri{%s}",i,belkin_uri[i],uri);
							find=1;
							break;
						}
					}
					if(find == 1){
						continue;
					}
					else{ 
						strcpy(belkin_uri[r++],uri);
						IOT_INFO("belkin_uri[%d] is : %s",i,belkin_uri[i]);
					}


					/*
					for (i=0;i<10;i++)
					{
						if(!strcmp(belkin_uri[i],uri))
						{
							IOT_INFO("belkin_uri[%d]{%s} is same as uri{%s}",i,belkin_uri[i],uri);
							i=10;
						}
				
						else if(belkin_uri[i][0]=="\0")
						{
							sprintf(belkin_uri[i],"%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
							IOT_INFO("belkin_uri[%d] is : %s",i,belkin_uri[i]);
							b++;
							i=10;
							enddevicestatus=1;
						}
					}
			
			
			
					//IOT_INFO("-------%s------\n",belkin_uri[0]);
					//b=1;
					belkinipstatus=1;
					*/
					enddevicestatus=1;
				}
			}
		}
		else;
     }
}

static int ConnectToHTTPServer(HTTPCli_Handle httpClient)
{
    long lRetVal = -1;
    struct sockaddr_in addr;
  
  
