purnankareddy/CC3200MOD-SDK/samples/tirtos/subscribe_publish_sample/subscribe_publish_sample.c
			IOT_INFO("philips config---\n");
			if((strcmp(keyString,"link button not pressed"))==0)
			{
				philipsidstatus=1;
			}
			else
			{
				id_len=sizeof(keyString);
				strncpy(philips_id,keyString,id_len);
				IOT_INFO("philips id: %s---\n", philips_id);
				philipsidstatus=2;
			}
			philips_config=0;
		}	
		}
		}
		if(philipsget==1)
		{
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*/

			char vinaybulbid[2];
			char vinaystatus[400];
			for(i=1;i<noOfToken;i+=42)
			{
				jsmntok_t key = tokenList[i];
				unsigned int length = key.end - key.start;
				IOT_INFO("length of the string is %d\n",length);
				char keyString[length + 1];    
				memcpy(keyString, &((const char *)ptr)[key.start], length);
				keyString[length] = '\0';
				
				IOT_INFO("i=%d\n",i);
				//if(i/21==0){
				//p_bulb = (struct philips_status *)malloc(sizeof(struct philips_status));
				//strcpy(p_bulb->bid,keyString);
				//IOT_INFO("Key: %s\n", p_bulb->bid);
				strncpy(p_bulbs.bid,keyString,strlen(keyString));
				//strncpy(vinaybulbid,keyString,strlen(keyString));
				//IOT_INFO("Key: %s\n", vinaybulbid);
				IOT_INFO("Key: %s\n", p_bulbs.bid);

				/////linked list//////
				//start = (struct list *)malloc(sizeof(struct list));
				//struct list *temp;
				
				IOT_INFO("Key: %s\n", keyString);	
				//}else if(i/22==0){
			 	key = tokenList[i+1];
				length = key.end - key.start;
				IOT_INFO("length of the string is %d\n",length);
				//char keyString1[length + 1];    
				memcpy(keyString, &((const char *)ptr)[key.start], length);
				keyString[length] = '\0';
		
				IOT_INFO("i=%d\n",i+1);
				//strncpy(p_bulb->statuses,keyString,length);
				//IOT_INFO("Key: %s\n", p_bulb->statuses);
				strncpy(p_bulbs.statuses,keyString,length);
				IOT_INFO("Key: %s\n", p_bulbs.statuses);
				//strncpy(vinaystatus,keyString,strlen(keyString));
				//IOT_INFO("Key: %s\n", vinaystatus);
				IOT_INFO("Key: %s\n", keyString);
				//}
//				IOT_INFO("Key: %s\n", keyString);
//				IOT_INFO("my Key: %s\n", keyString[1]);
				insertFirst(vinaybulbid,vinaystatus);
		
			}
			//philipsget=0;
		}
		
		
	}
    //}

    free(tokenList);

    return lRetVal;
}

/////////////get json

int getParseJSONData(char *ptr)
{
    long lRetVal = 0;
    int noOfToken;
    jsmn_parser parser;
    jsmntok_t   *tokenList;


    /* Initialize JSON PArser */
    jsmn_init(&parser);

    /* Get number of JSON token in stream as we we dont know how many tokens need to pass */
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), NULL, 10);
    if(noOfToken <= 0)
    {
    	IOT_INFO("Failed to initialize JSON parser\n\r");
    	return -1;

    }

    /* Allocate memory to store token */
    tokenList = (jsmntok_t *) malloc(noOfToken*sizeof(jsmntok_t));
    if(tokenList == NULL)
    {
        IOT_INFO("Failed to allocate memory\n\r");
        return -1;
    }

    /* Initialize JSON Parser again */
    jsmn_init(&parser);
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), tokenList, noOfToken);
    if(noOfToken < 0)
    {
    	IOT_INFO("Failed to parse JSON tokens\n\r");
    	lRetVal = noOfToken;
    }
    else
    {
    	IOT_INFO("Successfully parsed %ld JSON tokens\n\r", noOfToken);
	int i=1;
	
		
	for(i=1;i<noOfToken;i+=42)
	{
		jsmntok_t key = tokenList[i];
		unsigned int length = key.end - key.start;
		char keyString[length + 1];    
		memcpy(keyString, &((const char *)ptr)[key.start], length);
		keyString[length] = '\0';
		
		IOT_INFO("i=%d\n",i);
		//if(i/21==0){
				strncpy(p_bulb->bid,keyString,length+1);
				IOT_INFO("Key: %s\n", p_bulb->bid);
				IOT_INFO("Key: %s\n", keyString);	
		//}else if(i/22==0){
			 key = tokenList[i+1];
		 length = key.end - key.start;
		//char keyString1[length + 1];    
		memcpy(keyString, &((const char *)ptr)[key.start], length);
		keyString[length] = '\0';
		
		IOT_INFO("i=%d\n",i+1);
			strncpy(p_bulb->statuses,keyString,length+1);
			IOT_INFO("Key: %s\n", p_bulb->statuses);
			IOT_INFO("Key: %s\n", keyString);
		//}
//		IOT_INFO("Key: %s\n", keyString);
//		IOT_INFO("my Key: %s\n", keyString[1]);
		
	}
    }

    free(tokenList);

    return lRetVal;
}



/*!
    \brief This function read respose from server and dump on console

    \param[in]      httpClient - HTTP Client object

    \return         0 on success else -ve

    \note

    \warning
*/
static int readResponse(HTTPCli_Handle httpClient)
{
	long lRetVal = 0;
	int bytesRead = 0;
	int id = 0;
	unsigned long len = 0;
	int json = 0;
	char *dataBuffer=NULL;
	bool moreFlags = 1;
	const char *ids[4] = {
					HTTPStd_FIELD_NAME_CONTENT_LENGTH,
			                HTTPStd_FIELD_NAME_CONNECTION,
			                HTTPStd_FIELD_NAME_CONTENT_TYPE,
			                NULL
	                     };

	/* Read HTTP POST request status code */
	lRetVal = HTTPCli_getResponseStatus(httpClient);
	if(lRetVal > 0)
	{
		switch(lRetVal)
		{
		case 200:
		{
			IOT_INFO("HTTP Status 200\n\r");
			/*
                 Set response header fields to filter response headers. All
                  other than set by this call we be skipped by library.
			 */
			HTTPCli_setResponseFields(httpClient, (const char **)ids);

			/* Read filter response header and take appropriate action. */
			/* Note:
                    1. id will be same as index of fileds in filter array setted
                    in previous HTTPCli_setResponseFields() call.

                    2. moreFlags will be set to 1 by HTTPCli_getResponseField(), if  field
                    value could not be completely read. A subsequent call to
                    HTTPCli_getResponseField() will read remaining field value and will
                    return HTTPCli_FIELD_ID_DUMMY. Please refer HTTP Client Libary API
                    documenation @ref HTTPCli_getResponseField for more information.
			 */
			while((id = HTTPCli_getResponseField(httpClient, (char *)g_buff, sizeof(g_buff), &moreFlags))
					!= HTTPCli_FIELD_ID_END)
			{

				
				IOT_INFO("data in while---%s--%d--\n",(const char *)g_buff,sizeof(g_buff));
				IOT_INFO("Switch Case...%d..\n",id);
				len = strtoul((char *)g_buff, NULL, 0);
				//IOT_INFO("len in case0 -----%d-----\n",len);
				//IOT_INFO();
				len = sizeof(g_buff);
				switch(id)
				{
				case 0: /* HTTPCli_FIELD_NAME_CONTENT_LENGTH */
				{
					len = strtoul((char *)g_buff, NULL, 0);
					IOT_INFO("len in case0 -----%d-----\n",len);
				}
				break;
				case 1: /* HTTPCli_FIELD_NAME_CONNECTION */
				{
				}
				break;
				case 2: /* HTTPCli_FIELD_NAME_CONTENT_TYPE */
				{
					//len = strtoul((char *)g_buff, NULL, 10);
					//IOT_INFO("len in case2 -----%d-----\n",len);
					IOT_INFO("vinay---%s---\n",(const char *)g_buff);
					if(!strncmp((const char *)g_buff, "application/json",
							sizeof("application/json")))
					{
						json = 1;
						IOT_INFO("it is in json format");
					}
					else
					{
						/* Note:
                                Developers are advised to use appropriate
                                content handler. In this example all content
                                type other than json are treated as plain text.
						 */
						json = 0;
					}
					IOT_INFO(HTTPStd_FIELD_NAME_CONTENT_TYPE);
					IOT_INFO(" : ");
					IOT_INFO("application/json\n\r");
				}
				break;
				default:
				{
					IOT_INFO("Wrong filter id\n\r");
					lRetVal = -1;
					goto end;
				}
				}
			}
			bytesRead = 0;
			if(len > sizeof(g_buff))
			{
				dataBuffer = (char *) malloc(len);
				if(dataBuffer)
				{
					IOT_INFO("Failed to allocate memory\n\r");
					lRetVal = -1;
					goto end;
				}
			}
			else
			{
				dataBuffer = (char *)g_buff;
			}

			/* Read response data/body */
			/* Note:
                    moreFlag will be set to 1 by HTTPCli_readResponseBody() call, if more
		            data is available Or in other words content length > length of buffer.
		            The remaining data will be read in subsequent call to HTTPCli_readResponseBody().
		            Please refer HTTP Client Libary API documenation @ref HTTPCli_readResponseBody
		            for more information

			 */
			//bytesRead = HTTPCli_readResponseBody(httpClient, (char *)dataBuffer, len, &moreFlags);
			bytesRead = HTTPCli_readRawResponseBody(httpClient, (char *)dataBuffer, len);
			/*if(bytesRead < 0)
			{
				IOT_INFO("Failed to received response body\n\r");
				lRetVal = bytesRead;
				goto end;
			}
			else if( bytesRead < len || moreFlags)
			{
				IOT_INFO("Mismatch in content length and received data length\n\r");
				goto end;
			}*/
			dataBuffer[bytesRead] = '\0';

			if(json)
			{
				IOT_INFO("----%s-----\n",dataBuffer);
				/* Parse JSON data */
				//char *dummydata = "{\"on\":false}";
				//IOT_INFO("------%s----\n",dummydata);
				//lRetVal = ParseJSONData(dummydata);
				//if(lRetVal < 0)
				//{
				//	goto end;
				//}
				lRetVal = ParseJSONData(dataBuffer);
				//lRetVal = getParseJSONData(dataBuffer);
				if(lRetVal < 0)
				{
					goto end;
				}
			}
			else
			{
				/* treating data as a plain text */
				//IOT_INFO("----%s-----\n",dataBuffer);
			}

