purnankareddy/CC3200MOD-SDK/samples/tirtos/subscribe_publish_sample/subscribe_publish_sample.c
    return lRetVal;
}



////////------------//////////

char HostAddress[255] = AWS_IOT_MQTT_HOST;
uint32_t port = AWS_IOT_MQTT_PORT;
uint32_t publishCount = 0;
unsigned int  uiChannel;
float pw=0;
int ch=0;
int status=0;


float power(int ch_no){
if (ch_no == 1)
	uiChannel = ADC_CH_0;
else if (ch_no == 2)
	uiChannel = ADC_CH_1;
else if (ch_no == 3)
	uiChannel = ADC_CH_2;
else if (ch_no == 4)
	uiChannel = ADC_CH_3;

#ifdef CC3200_ES_1_2_1
        //
        // Enable ADC clocks.###IMPORTANT###Need to be removed for PG 1.32
        //
        HWREG(GPRCM_BASE + GPRCM_O_ADC_CLK_CONFIG) = 0x00000043;
        HWREG(ADC_BASE + ADC_O_ADC_CTRL) = 0x00000004;
        HWREG(ADC_BASE + ADC_O_ADC_SPARE0) = 0x00000100;
        HWREG(ADC_BASE + ADC_O_ADC_SPARE1) = 0x0355AA00;
#endif

        //
        // Configure ADC timer which is used to timestamp the ADC data samples
        //
        MAP_ADCTimerConfig(ADC_BASE,2^17);

	//PinTypeADC(PIN_59, 0xFF);

        //
        // Enable ADC timer which is used to timestamp the ADC data samples
        //
        MAP_ADCTimerEnable(ADC_BASE);

        //
        // Enable ADC module
        //
        MAP_ADCEnable(ADC_BASE);

        //
        // Enable ADC channel
        //

        MAP_ADCChannelEnable(ADC_BASE, uiChannel);
	//MAP_UtilsDelay(800000);

	if(MAP_ADCFIFOLvlGet(ADC_BASE, uiChannel)){

	        unsigned long ulSample = MAP_ADCFIFORead(ADC_BASE, uiChannel);
		IOT_INFO("%lu\n",ulSample);
		IOT_INFO("%f...\n",(float)((ulSample >> 2 ) & 0x0FFF));
		IOT_INFO("\n\rVoltage is %f\n\r",(((float)((ulSample >> 2 ) & 0x0FFF))*1.4)/4096);
		pw=(((float)((ulSample >> 2 ) & 0x0FFF))*1.4)/4096;
	}
return pw;
}


void MQTTcallbackHandler(AWS_IoT_Client *pClient, char *topicName,
        uint16_t topicNameLen, IoT_Publish_Message_Params *params, void *pData)
{
	//int status=0;
    IOT_INFO("Subscribe callback");
    IOT_INFO("%.*s\t%.*s",topicNameLen, topicName, (int)params->payloadLen,
            (char *)params->payload);

    IOT_INFO("%d",(int)params->payloadLen);
    IOT_INFO("%s",(char *)params->payload);

    int size = (int)params->payloadLen;
    IOT_INFO("--------%d------\n",size);
    //const char *string = ((char *)params->payload);
    char string[size];
    //char string1[size];
    //char *string1;
    //string1 = malloc(size);
    int dummy = 0;
    //memset(string, '\0', sizeof(string));
    strcpy(string,(char *)params->payload);
    strncat(string, " ", size+1);
    IOT_INFO("vinay----%s------\n",string);
if(!strncmp((char *)params->payload ,"gpio", 4)){
 const char s[2] = " ";
   char *token;
   
   /* get the first token */
   token = strtok(string, s);
   char *word[5];
   int dummy2 = 0;
   
   /* walk through other tokens */
   while( token != NULL ) 
   {
      printf( " %s\n", token );
      word[dummy2] = token;
      dummy2++;
    
      token = strtok(NULL, s);
   }
   IOT_INFO("---%s-----\n",word[4]);
   //for(dummy=0;dummy<=dummy2;dummy++){
	//if(word[dummy] == "from"){
         strcpy(userid,word[4]);//}}
   IOT_INFO("userid---%s-----\n",userid);
}
if(!strncmp((char *)params->payload ,"belkin", 6)){
 const char s[2] = " ";
   char *token;
	int belkin_number;
   
   /* get the first token */
   token = strtok(string, s);
   char *word[5];
   int dummy2 = 0;
   
   /* walk through other tokens */
   while( token != NULL ) 
   {
      printf( " %s\n", token );
      word[dummy2] = token;
      dummy2++;
    
      token = strtok(NULL, s);
   }
   //IOT_INFO("---%s-----\n",word[4]);
   //for(dummy=0;dummy<=dummy2;dummy++){
	//if(word[dummy] == "from"){
        // strcpy(userid,word[4]);//}}
   //IOT_INFO("userid---%s-----\n",userid);

belkin_number=atoi(word[1]);
IOT_INFO("belkin number=%d\n",belkin_number);
IOT_INFO("Belkin Function Call...\n");
long lRetVal = -1;
strcpy(HOST_NAME,belkin_uri[belkin_number-1]);
HOST_PORT = 49153;
    HTTPCli_Struct httpClient;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    if(!strcmp(word[2],"on"))
    lRetVal = HTTPPostMethodon(&httpClient);
    else if(!strcmp(word[2],"off"))
    lRetVal = HTTPPostMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
}

 if(!strncmp((char *)params->payload ,"gpio 1 on", 9)){
	GPIOPinWrite(GPIOA3_BASE, 0x10, 0x10);
	ch = 1;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);

 }

 if(!strncmp((char *)params->payload ,"gpio 2 on", 9)){
	GPIOPinWrite(GPIOA1_BASE, 0x80, 0x80);
	ch =2;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
}

 if(!strncmp((char *)params->payload ,"gpio 3 on", 9)){
        GPIOPinWrite(GPIOA1_BASE, 0x40, 0x40);
	ch =3;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp((char *)params->payload ,"gpio 4 on", 9)){
        GPIOPinWrite(GPIOA1_BASE, 0x10, 0x10);

	ch=4;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 } 

 if(!strncmp((char *)params->payload ,"gpio 1 off", 10)){
	GPIOPinWrite(GPIOA3_BASE, 0x10, 0x0);
ch =1;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp((char *)params->payload ,"gpio 2 off", 10)){
	GPIOPinWrite(GPIOA1_BASE, 0x80, 0x0);
ch=2;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp((char *)params->payload ,"gpio 3 off ", 10)){
        GPIOPinWrite(GPIOA1_BASE, 0x40, 0x0);
ch=3;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp((char *)params->payload ,"gpio 4 off", 10)){
        GPIOPinWrite(GPIOA1_BASE, 0x10, 0x0);
 ch=4;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 } 
 if(!strncmp((char *)params->payload ,"discover", 8)){
	IOT_INFO("----Discover-----");
	//sri_recev();	
	//discover();
	//vinayudp();
	enddevicestatus=1;

	        
