purnankareddy/CC3200MOD-SDK/samples/tirtos/subscribe_publish_sample/subscribe_publish_sample.c
 }
 if(!strncmp((char *)params->payload ,"multicast", 9)){
	IOT_INFO("----SENDMULTICAST-----");
	//SendMulticast();
 }
/* if(!strncmp((char *)params->payload ,"multi", 5)){
	IOT_INFO("----SENDRevice-----");
recievepack();
}*/
 if(!strncmp((char *)params->payload ,"demouser", 8)){
	IOT_INFO("----SENDRevice-----");
//recievepack();
}

 if(!strncmp((char *)params->payload ,"philps get", 10)){
philipsget=1;
//enddevicestatus=1;
IOT_INFO("philips Function Call...\n");
//getip();
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
IOT_INFO("philips get uri before :  %s\n",philips_request_uri);
sprintf(philips_request_uri,"/api/%s/lights",philips_id);
IOT_INFO("philips get uri after :  %s\n",philips_request_uri);
long lRetVal = -1;
    HTTPCli_Struct httpClient;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient);
    /*if(lRetVal < 0)
    {
        LOOP_FOREVER();
    }
*/
    IOT_INFO("\n\r");

/* IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r");
*/
IOT_INFO("HTTP Get Begin:\n\r");
    lRetVal = HTTPGetMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post Get failed.\n\r");
    }
    IOT_INFO("HTTP Get End:\n\r");

}

    if(!strncmp((char *)params->payload ,"philps off", 10)){
IOT_INFO("philips Function Call...\n");
//getip();
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
sprintf(philips_request_uri,"/api/%s/lights/1/state",philips_id);
long lRetVal = -1;
    HTTPCli_Struct httpClient;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient);
    /*if(lRetVal < 0)
    {
        LOOP_FOREVER();
    }
*/
    IOT_INFO("\n\r");

 IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r");

}

    if(!strncmp((char *)params->payload ,"philps on", 9)){
IOT_INFO("philips Function Call...\n");
//getip();
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
sprintf(philips_request_uri,"/api/%s/lights/1/state",philips_id);
long lRetVal = -1;
    HTTPCli_Struct httpClient;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");

 IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethodon(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r"); 
}

    if(!strncmp((char *)params->payload ,"philps config", 13)){
IOT_INFO("philips config Call...\n");
enddevicestatus=1;
philips_config=1;
long lRetVal = -1;
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
sprintf(philips_request_uri,"/api");
    HTTPCli_Struct httpClient;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    lRetVal = philipsconfig(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
}

    if(!strncmp((char *)params->payload ,"belkin on", 9)){
IOT_INFO("Belkin Function Call...\n");
long lRetVal = -1;
strcpy(HOST_NAME,belkin_uri[0]);
HOST_PORT = 49153;
    HTTPCli_Struct httpClient;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    lRetVal = HTTPPostMethodon(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
}

if(!strncmp((char *)params->payload ,"belkin off", 10)){
IOT_INFO("Belkin Function Call...\n");
long lRetVal = -1;
strcpy(HOST_NAME,belkin_uri[0]);
HOST_PORT = 49153;
    HTTPCli_Struct httpClient;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    lRetVal = HTTPPostMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
}

if (!strncmp((char *)params->payload , "gpio all on", 11)){
    IOT_INFO("\n GPIO OFF using COPY..  \n");
    GPIOPinWrite(GPIOA3_BASE, 0x10, 0x10);
    GPIOPinWrite(GPIOA1_BASE, 0x80, 0x80);
    GPIOPinWrite(GPIOA1_BASE, 0x40, 0x40);
    GPIOPinWrite(GPIOA1_BASE, 0x10, 0x10);
}
if (!strncmp((char *)params->payload , "gpio all off", 12)){
    IOT_INFO("\n GPIO OFF using COPY..  \n");
    GPIOPinWrite(GPIOA3_BASE, 0x10, 0);
    GPIOPinWrite(GPIOA1_BASE, 0x80, 0);
    GPIOPinWrite(GPIOA1_BASE, 0x40, 0);
    GPIOPinWrite(GPIOA1_BASE, 0x10, 0);
}
}

void disconnectCallbackHandler(AWS_IoT_Client *pClient, void *data)
{
    IOT_WARN("MQTT Disconnect");
    IoT_Error_t rc = SUCCESS;

    if (NULL == data) {
        return;
    }

    AWS_IoT_Client *client = (AWS_IoT_Client *)data;
    if (aws_iot_is_autoreconnect_enabled(client)) {
        IOT_INFO("Auto Reconnect is enabled, Reconnecting attempt will start now");
    }
    else {
        IOT_WARN("Auto Reconnect not enabled. Starting manual reconnect...");
        rc = aws_iot_mqtt_attempt_reconnect(client);
        if (NETWORK_RECONNECTED == rc) {
            IOT_WARN("Manual Reconnect Successful");
            IOT_WARN("Manual Reconnect Failed - %d", rc);
        }
        else {
            IOT_WARN("Manual Reconnect Failed - %d", rc);
        }
    }
}

void runAWSClient(void)
{
IOT_INFO("\n....RUNNING....AWS_IOT...\n");
    IoT_Error_t rc = SUCCESS;
    int32_t i = 0;
    bool infinitePublishFlag = true;
    char *topicName = "sdkTest/sub";
    int topicNameLen = strlen(topicName);
    char *pubtopicName = "sdkTest/pub";
    int pubtopicNameLen = strlen(pubtopicName);

    AWS_IoT_Client client;
    IoT_Client_Init_Params mqttInitParams = iotClientInitParamsDefault;
    IoT_Client_Connect_Params connectParams = iotClientConnectParamsDefault;

    IoT_Publish_Message_Params paramsQOS0;
    IoT_Publish_Message_Params paramsQOS1;

    IOT_INFO("\nAWS IoT SDK Version %d.%d.%d-%s\n", VERSION_MAJOR, VERSION_MINOR,
            VERSION_PATCH, VERSION_TAG);


    mqttInitParams.enableAutoReconnect = false; // We enable this later below
    mqttInitParams.pHostURL = HostAddress;
    mqttInitParams.port = port;
    /*
     *  The following cert file variables are not used in this release. All
     *  cert files must exist in the "/certs" directory and be named "ca.der",
     *  "cert.der" and "key.der", as shown in the certflasher application. The
     *  ability to change this will be added in a future release.
     */
    mqttInitParams.pRootCALocation = AWS_IOT_ROOT_CA_FILENAME;
    mqttInitParams.pDeviceCertLocation = AWS_IOT_CERTIFICATE_FILENAME;
    mqttInitParams.pDevicePrivateKeyLocation = AWS_IOT_PRIVATE_KEY_FILENAME;
    mqttInitParams.mqttCommandTimeout_ms = 20000;
    mqttInitParams.tlsHandshakeTimeout_ms = 5000;
    mqttInitParams.isSSLHostnameVerify = true;
    mqttInitParams.disconnectHandler = disconnectCallbackHandler;
    mqttInitParams.disconnectHandlerData = (void *)&client;

    rc = aws_iot_mqtt_init(&client, &mqttInitParams);
    if (SUCCESS != rc) {
        IOT_ERROR("aws_iot_mqtt_init returned error : %d ", rc);
    }

    connectParams.keepAliveIntervalInSec = 10;
    connectParams.isCleanSession = true;
    connectParams.MQTTVersion = MQTT_3_1_1;
    connectParams.pClientID = AWS_IOT_MQTT_CLIENT_ID;
    connectParams.clientIDLen = (uint16_t)strlen(AWS_IOT_MQTT_CLIENT_ID);
    connectParams.isWillMsgPresent = false;

    IOT_INFO("Connecting...");
    rc = aws_iot_mqtt_connect(&client, &connectParams);
    if (SUCCESS != rc) {
        IOT_ERROR("Error(%d) connecting to %s:%d", rc, mqttInitParams.pHostURL,
                mqttInitParams.port);
    }

