purnankareddy/CC3200MOD-SDK/samples/tirtos/subscribe_publish_sample/subscribe_publish_sample.c
    /*
     *  Enable Auto Reconnect functionality. Minimum and Maximum time of
     *  exponential backoff are set in aws_iot_config.h:
     *  #AWS_IOT_MQTT_MIN_RECONNECT_WAIT_INTERVAL
     *  #AWS_IOT_MQTT_MAX_RECONNECT_WAIT_INTERVAL
     */
    rc = aws_iot_mqtt_autoreconnect_set_status(&client, true);
    if (SUCCESS != rc) {
        IOT_ERROR("Unable to set Auto Reconnect to true - %d", rc);
    }

    IOT_INFO("Subscribing...");
    rc = aws_iot_mqtt_subscribe(&client, topicName, topicNameLen, QOS0,
            MQTTcallbackHandler, NULL);
    if (SUCCESS != rc) {
        IOT_ERROR("Error subscribing (%d)", rc);
    }

    char cPayload[512];
    sprintf(cPayload, "%s : %d ", "hello from SDK", i);

    paramsQOS0.qos = QOS0;
    paramsQOS0.payload = (void *)cPayload;
    paramsQOS0.isRetained = 0;

    paramsQOS1.qos = QOS1;
    paramsQOS1.payload = (void *)cPayload;
    paramsQOS1.isRetained = 0;

    if (publishCount != 0) {
       infinitePublishFlag = false;
    }

    while ((NETWORK_ATTEMPTING_RECONNECT == rc || NETWORK_RECONNECTED == rc ||
            SUCCESS == rc) && (publishCount > 0 || infinitePublishFlag)) {
        rc = aws_iot_mqtt_yield(&client, 100);

        if (NETWORK_ATTEMPTING_RECONNECT == rc) {
            /* If the client is attempting to reconnect, skip rest of loop */
            continue;
        }
	
        IOT_INFO("-->sleep");
        Task_sleep(1000);
       /* sprintf(cPayload, "%s : %d ", "hello from SDK QOS0", i++);
        // Recalculate string len to avoid truncation in subscribe callback 
        paramsQOS0.payloadLen = strlen(cPayload);
        rc = aws_iot_mqtt_publish(&client, pubtopicName, pubtopicNameLen,
                &paramsQOS0);*/
        if (publishCount > 0) {
           publishCount--;
        }
	
	if(ch!=0){
        //sprintf(cPayload, "%s : %f ", "Power = ", power(ch));
	//sprintf(cPayload, "Power of socket %d = %f -----at time %s",ch , power(ch),timeslap);
	sprintf(cPayload, "{ \n \"socketId\" : \"%d\",\n\"status\" : \"%d\",\n\"power\" : \"%f\",\n\"dexterpi_id\" : \"DXTRPIE1\",\n\"userId\" : \"%s\"\n}",ch,status,power(ch),userid);
	
        /* Recalculate string len to avoid truncation in subscribe callback */
        paramsQOS1.payloadLen = strlen(cPayload);
        do {
            rc = aws_iot_mqtt_publish(&client, pubtopicName, pubtopicNameLen,
                    &paramsQOS1);
            if (publishCount > 0) {
                publishCount--;
            }
        } while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                (publishCount > 0 || infinitePublishFlag));
   
        ch =0;
	}


	if(enddevicestatus==1)
	{
		IOT_INFO("discover is called\n");
		char *pubtopicNames = "theja";//"enddevices/status";
    		int pubtopicNamesLen = strlen(pubtopicNames);
		
		if(philipsidstatus==0)
		{
			sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : [\"%s\",\"not yet get\"],\n\"Belkin1IPStatus\" : \"%s\",\n\"Belkin2IPStatus\" : \"%s\",\n\"Belkin3IPStatus\" : \"%s\",\n\"Belkin4IPStatus\" : \"%s\",\n\"Belkin5IPStatus\" : \"%s\",\n\"Belkin6IPStatus\" : \"%s\",\n\"Belkin7IPStatus\" : \"%s\",\n\"Belkin8IPStatus\" : \"%s\",\n\"Belkin9IPStatus\" : \"%s\",\n\"Belkin10IPStatus\" : \"%s\",\n\"dexterpi_id\" : \"DEXT01\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9]);
		}
		else if(philipsidstatus==1)
		{
			sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : [\"%s\",\"please press link button on hue bridge\"],\n\"Belkin1IPStatus\" : \"%s\",\n\"Belkin2IPStatus\" : \"%s\",\n\"Belkin3IPStatus\" : \"%s\",\n\"Belkin4IPStatus\" : \"%s\",\n\"Belkin5IPStatus\" : \"%s\",\n\"Belkin6IPStatus\" : \"%s\",\n\"Belkin7IPStatus\" : \"%s\",\n\"Belkin8IPStatus\" : \"%s\",\n\"Belkin9IPStatus\" : \"%s\",\n\"Belkin10IPStatus\" : \"%s\",\n\"dexterpi_id\" : \"DEXT01\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9]);			
//sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%d\",\n\"BelkinIPStatus\" : \"%d\",\n\"PhilipsUserIDStatus\" : \"please press link button on hue bridge\",\n\"dexterpi_id\" : \"DEXT01\"\n}",philipsipstatus,belkinipstatus);
		}
		else if(philipsidstatus==2)
		{
			sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : [\"%s\",\"have an new userid\"],\n\"Belkin1IPStatus\" : \"%s\",\n\"Belkin2IPStatus\" : \"%s\",\n\"Belkin3IPStatus\" : \"%s\",\n\"Belkin4IPStatus\" : \"%s\",\n\"Belkin5IPStatus\" : \"%s\",\n\"Belkin6IPStatus\" : \"%s\",\n\"Belkin7IPStatus\" : \"%s\",\n\"Belkin8IPStatus\" : \"%s\",\n\"Belkin9IPStatus\" : \"%s\",\n\"Belkin10IPStatus\" : \"%s\",\n\"dexterpi_id\" : \"DEXT01\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9]);
			//sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%d\",\n\"BelkinIPStatus\" : \"%d\",\n\"PhilipsUserIDStatus\" : \"have an new userid\",\n\"dexterpi_id\" : \"DEXT01\"\n}",philipsipstatus,belkinipstatus);
		}
		/*
		else if(philipsget==1)
		{
			sprintf(cPayload,"%s",philipsgetdata);
			philipsget=0;
		}*/
		else
		{
			sprintf(cPayload,"discover");
		}
		IOT_INFO("cpayload---%s----",cPayload);
        	/* Recalculate string len to avoid truncation in subscribe callback */
        	paramsQOS1.payloadLen = strlen(cPayload);
        	do {
			
            		rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    	&paramsQOS1);
			IOT_INFO("discover is called to publish\n");
            		if (publishCount > 0) {
                		publishCount--;
            		}
        	} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                (publishCount > 0 || infinitePublishFlag));
		enddevicestatus=0;
	}
	
/////////added for philips get///////
		if(philipsget==1)
		{
			IOT_INFO("philips get  is called\n");
			char *pubtopicNames = "theja";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);

			
