purnankareddy/CC3200MOD-SDK/samples/tirtos/subscribe_publish_sample/subscribe_publish_sample.c
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*/

			//////////from linked kist example/////
			struct node *ptr = (struct node *)malloc(sizeof(struct node));
			ptr = head;
   			IOT_INFO("\n[ ");
	
   			//start from the beginning
   			while(ptr != NULL) {
      			IOT_INFO("(%s,%s) ",ptr->bulbid,ptr->status);
			sprintf(cPayload,"{\n\"bulbid\" : \"%s\",\n\"status\" : \"%s\"\n}",ptr->bulbid,ptr->status);
			IOT_INFO("cpayload---%s----",cPayload);
        		/* Recalculate string len to avoid truncation in subscribe callback */
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
			
            		rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    	&paramsQOS1);
			IOT_INFO("discover is called to publish\n");
            		if (publishCount > 0) {
                		publishCount--;
            		}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                	(publishCount > 0 || infinitePublishFlag));
			//enddevicestatus=0;
      			ptr = ptr->next;
   			}
	
   			IOT_INFO(" ]");
			while(!isEmpty()) {            
      			struct node *temp = deleteFirst();
      			//printf("\nDeleted value:");
      			//printf("(%d,%d) ",temp->key,temp->data);
   			}  
			//////////////
			philipsget=0;
		}	
////////////////////////////

	else{
        sprintf(cPayload, "%s : %d ", "hello from SDK QOS1", i++);
	}
 }

    if (SUCCESS != rc) {
        IOT_ERROR("An error occurred in the loop. Error code = %d\n", rc);
    }
    else {
        IOT_INFO("Publish done\n");
    }
}
